#pragma once

// 蛇口クラス

class Tap
{
public:
	Tap();
	virtual ~Tap();

	//------------------------------------
	/**
	 * 蛇口を開く
	 **/
	void turnOn();

	//------------------------------------
	/**
	 * 蛇口を閉じる
	 **/
	void turnOff();

	//------------------------------------
	/**
	 * 蛇口の開閉状態を返す
	 **/
	bool isOpen() const;

	//------------------------------------
	/**
	 * 毎秒の流出量(cm3/秒)を返す
	 **/
	double getRunOff() const;

private:
	//------------------------------------
	/**
	 *蛇口の開閉状態
	 **/
	bool _bOpen;

	//------------------------------------
	/**
	 * 流出量
	 **/
	double _runOff;
};

